# AnalyticalAutomationFailures Properties

---
The BuiltInFailuresAnalyticalAutomationFailures type exposes the following members.
| Name| Description
---|---|---
| EmptySelection|  There are no selected elements.
Top
#### Reference
BuiltInFailuresAnalyticalAutomationFailures Class
Autodesk.Revit.DB Namespace